app/views/cart/createOrder.html.erb


      <% item = Item.find_by_id(id) %>
---
SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1