app/views/cart/index.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" = 1 LIMIT 1
---

      <% item = Item.find_by_id(id) %>